In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [2]:
def read_data(path):
    if '.csv' in path:
        return pd.read_csv(path)
    elif '.xlsx' in path:
        return pd.read_excel(path)

In [32]:
df = read_data('./data/test_scores.csv')
df.head()

,school,school_setting,school_type,classroom,teaching_method,n_student,student_id,gender,lunch,pretest,posttest
0,ANKYI,Urban,Non-public,6OL,Standard,20.0,2FHT3,Female,Does not qualify,62.0,72.0
1,ANKYI,Urban,Non-public,6OL,Standard,20.0,3JIVH,Female,Does not qualify,66.0,79.0
2,ANKYI,Urban,Non-public,6OL,Standard,20.0,3XOWE,Male,Does not qualify,64.0,76.0
3,ANKYI,Urban,Non-public,6OL,Standard,20.0,556O0,Female,Does not qualify,61.0,77.0
4,ANKYI,Urban,Non-public,6OL,Standard,20.0,74LOE,Male,Does not qualify,64.0,76.0

In [34]:
df.loc[-1] = ['ANKYI',	'', np.nan,	np.nan,	np.nan,np.nan,	np.nan,np.nan,	np.nan,	np.nan,	np.nan,]
df.reset_index(drop=True, inplace=True)

In [35]:
df.shape

(2134, 11)

In [36]:
df.columns

Index(['school', 'school_setting', 'school_type', 'classroom',
       'teaching_method', 'n_student', 'student_id', 'gender', 'lunch',
       'pretest', 'posttest'],
      dtype='object')

In [46]:
df = df.astype({'school':str})

In [48]:
df['school'].astype(str)

0       ANKYI
1       ANKYI
2       ANKYI
3       ANKYI
4       ANKYI
        ...
2129    ZOWMK
2130    ZOWMK
2131    ZOWMK
2132    ZOWMK
2133    ANKYI
Name: school, Length: 2134, dtype: object

In [49]:
df.describe()

         n_student      pretest     posttest
count  2133.000000  2133.000000  2133.000000
mean     22.796531    54.955931    67.102203
std       4.228893    13.563101    13.986789
min      14.000000    22.000000    32.000000
25%      20.000000    44.000000    56.000000
50%      22.000000    56.000000    68.000000
75%      27.000000    65.000000    77.000000
max      31.000000    93.000000   100.000000

In [47]:
a = df.dtypes
a

school              object
school_setting      object
school_type         object
classroom           object
teaching_method     object
n_student          float64
student_id          object
gender              object
lunch               object
pretest            float64
posttest           float64
dtype: object

In [41]:
a['school'] == 'O'

True

In [ ]:
df['school']

In [22]:
df[df['school_setting'].isnull()]

Empty DataFrame
Columns: [school, school_setting, school_type, classroom, teaching_method, n_student, student_id, gender, lunch, pretest, posttest]
Index: []

In [ ]:
def data_wrangling(df, method='remove'):
    columns = df.columns
    columns_type = df.dtypes
    
    for column in columns:
            if 'int' in columns_type[column]:
                return
            elif 'float64' in columns_type[column]:
                return
            else: